<template>
	<view>
		<view class="agree">
			<text class="tis">特别提示:</text>
			<text class="neir">你在使用上海千匠网络科技有限公司（以下简称“千匠网络”）及关联公司提供的各项服务之前，请你务必审慎阅读、
				充分理解本协议各条款内容，特别是以粗体标注的部分，包括但不限于免除或者限制责任的条款。如你不同意本服务协议及/或随时对其的修改，
				你应立即停止注册；你一旦使用千匠网络提供的服务，即视为你已了解并完全同意本服务协议各项内容，包括千匠网络对服务协议所做的修改，
				并成为我们的用户。<br />一、帐号注册<br />1、当你注册成功帐号并且与某个千匠网络提供技术支持的电子商务交易平台（以下简称“交易平台”）
				发生行为关联时（包括不限于开通产品、短信充值、产生购买行为），你授权该交易平台获得你的手机帐号以方便下单购买。<br />2、当你选择通过第
				三方授权登录程序进入千匠网络，你需授权千匠网络收集你的帐号昵称及头像等标识化的个人信息，授权完成后，你即成为千匠网络的“用户”。当你按照注册页面提示填写信息并注册成功后，
				你即成为千匠网络的“用户”；千匠网络将给予你一个用户帐号，密码由你自行设置。该用户帐号和密码由你自行负责保管。你应当对你在千匠网络进行的活动和事件负法律责任。<br />3、
				本协议服务条款和公告可由千匠网络定时更新，并按照法定流程进行公示。你在使用相关服务时,应关注并遵守其所适用的相关条款。<br />4、使用同一身份认证信息、
				同一手机号或经千匠网络排查认定多个千匠网络账户的实际控制人为同一人的，均视为同一用户。<br />5、你确认，在你开始使用本服务前，
				你应当具备中华人民共和国法律规定的与你行为相适应的民事行为能力。若你不具备前述与你行为相适应的民事行为能力，则你需要在你监护人的陪同下完成注册，
				并且你与你的监护人应依照法律规定承担因此而导致的一切后果。<br />二、注册信息和隐私保护<br />1、你帐号的所有权归千匠网络，使用权归你。你按注册页面引导填写信息，
				阅读并同意本协议且完成全部注册程序后，即可获得注册帐号并成为用户。你应提供及时、详尽及准确的个人资料，并不断更新注册资料，符合及时、详尽准确的要求。
				所有原始键入的资料将引用为注册资料。如果因注册信息不真实或更新不及时而引发的相关问题，由你自行承担相应的责任。<br />2、
				你应当通过真实身份信息认证注册帐号，且你提交的帐号名称、头像、&nbsp;简介等注册信息中不得出现违法和不良信息，经公司审核
				，如存在上述情况，千匠网络将不予注册；同时，在注册后，如发现你以虚假信息骗取帐号名称注册，或其帐号头像、简介等注册信息存在违法和不良信息的
				，千匠网络有权不经通知单方采取限期改正、暂停使用、注销登记、收回等措施。<br />3、你帐号包括帐户名称和密码，账户名称作为你有效的身份凭证之一。你可使用手机号和密码登录。
				<br />4、你不应将其帐号、密码转让、出售或出借予他人使用，若你授权他人使用帐户，应对被授权人在该帐户下发生所有行为负全部责任。由于你其他账户使用信息，仅当依法律法规
				、司法裁定或经千匠网络同意，并符合千匠网络规定的用户帐号转让流程的情况下，方可进行帐号的转让。<br />5、因你个人原因导致的帐号信息遗失，如需找回帐号信息，
				请按照帐号找回要求提供相应的信息，并确保提供的信息合法真实有效，若提供的信息不符合要求，无法通过安全验证，千匠网络有权拒绝提供帐号找回服务；若帐号的唯一凭证不再有效，
				千匠网络有权拒绝支持帐号找回。例如手机号二次出售，千匠网络可拒绝支持帮助找回原手机号绑定的帐号。
			</text>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {

			}
		},
		methods: {

		}
	}
</script>

<style scoped lang="scss">
	.agree {
		width: 90%;
		margin: auto;

		.tis {
			display: block;
			color: rgba(51, 51, 51, 1);
			overflow-wrap: break-word;
			color: rgba(51, 51, 51, 1);
			font-size: 14px;
			font-family: PingFangSC-Semibold;
			margin-top: 20rpx;
		}

		.neir {
			display: inline-block;
			overflow-wrap: break-word;
			color: rgba(153, 153, 153, 1);
			font-size: 12px;
			font-family: PingFangSC-Regular;
			line-height: 18px;
			text-align: justify;
			margin-top: 8px;
		}
	}
</style>
