<template>
	<view>
		<view class="agree">
			<text class="tis">引言</text>
			<text class="neir">欢迎你使用我们的产品和服务！我们深知个人信息对你的重要性，你的信任对我们非常重要，
				我们将根据法律法规要求并参照行业最佳实践为你的个人信息安全提供充分保障。鉴于此，千匠网络制定本《隐私政策》
				（下称“本政策/本隐私权政策”）以帮助你充分了解在你使用我们的产品与/或服务时，
				我们如何收集、使用、保存、共享和转让这些信息，以及我们为你提供的访问、更新、删除和保护这些信息的方式。
			</text>
			<text class="tis">本隐私政策将帮助你了解以下内容：</text>
			<text class="neir">一、我们如何收集和使用你的个人信息<br />二、我们如何使用Cookies和同类技术<br />
				三、我们如何“共享”“转让”“公开披露”你的个人信息<br />四、我们如何保护和保存你的个人信息<br />
				五、你如何管理个人信息<br />六、未成年人的个人信息保护<br />七、通知和修订<br />八、如何联系我们<br />
				本政策适用于千匠网络提供的所有产品和服务。如千匠网络及关联公司（范围详见定义部分）
				的产品或服务中使用了千匠网络提供的产品或服务（例如使用千匠网络帐号登录）但未设独立隐私权政策的，则本政策同样适用于该部分产品或服务。
				我们及关联公司就其向你提供的产品或服务单独设立有隐私权政策的（如《千匠网络支付隐私政策》），则相应产品或服务适用相应隐私政策。<br />
				需要特别说明的是，本隐私政策不适用于其他第三方通过前述网页或客户端或者小程序或公众号等向你提供的服务。例如你通过千匠网络使用第三方应用
				（如千匠网络应用市场）或者服务，或第三方服务和产品依托千匠网络产品向你提供服务时，你向第三方提供的信息不适用本政策。<br />
				在使用千匠网络各项产品或服务前，请你务必仔细阅读和理解对应的隐私政策，特别是以粗体/粗体下划线标识的条款，你应重点阅读，确认你充分理解并同意后再开始使用。<br />
				如对本政策内容有任何疑问、意见或建议，你可与我们联系。<br />我们将担任“个人信息处理者”，亦即我们将决定“为何”和“如何”收集和使用你的个人信息。<br />
				为提供我们的产品及服务给你，我们需要和我们的“个人信息受托者”，即认可的商业伙伴或我们的关联合作伙伴共享你的个人信息。
				他们均负有采用适当安全措施以保护所持个人信息的义务，受严格的保密义务所规范，
				且“为何”和“如何”可以代替我们处理你的个人信息均受相关合同条款所约束。
			</text>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {

			}
		},
		created() {
			
		},
		methods: {

		}
	}
</script>

<style scoped lang="scss">
	.agree {
		width: 90%;
		margin: auto;

		.tis {
			display: block;
			color: rgba(51, 51, 51, 1);
			overflow-wrap: break-word;
			color: rgba(51, 51, 51, 1);
			font-size: 14px;
			font-family: PingFangSC-Semibold;
			margin-top: 20rpx;
		}

		.neir {
			display: inline-block;
			overflow-wrap: break-word;
			color: rgba(153, 153, 153, 1);
			font-size: 12px;
			font-family: PingFangSC-Regular;
			line-height: 18px;
			text-align: justify;
			margin-top: 8px;
		}
	}
</style>
